///////////////////////////////////////////////////////////////////////////////
//ARQUIVO:    SubrotinasLoRa
//AUTOR:      Fábio Almeida
//CRIADO:     03/01/2024
//OBSERVAÇÕES:
////////////////////////////////////////////////////////////////////////////////
#include "main.h"
#include "global.h"
/*==============================================================================
CONSTANTES DO ARQUIVO
==============================================================================*/
/*==============================================================================
PROTOCOLO LORA
==============================================================================*/
void protocoloLora() {

	if(flagPacoteLora) {
		signed int index = indexOf(bufferLora, "$,01,");

		if(index >= 0) {
			uint8_t comando = charToByte(bufferLora[index + 6]);
			flagLedCOM = true; //por enquanto somente feedback
		}

		flagPacoteLora = false;
		apagaLoraBuffer();
	}
}
/*==============================================================================
FIM DO ARQUIVO
==============================================================================*/
